Revit 2017 API
StructuralSectionRectangular.NominalWeight Property
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public double NominalWeight { get; set; }
Visual Basic
Public Property NominalWeight As Double
	Get
	Set
Visual C++
public:
property double NominalWeight {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace